docs: revert to mermaid diagram but make it vertical
